Autodesk.Revit.DB.ConfigurationReloadInfo.IsValidSwapIndex(System.Int32)
validate swap index.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo.GetOutOfDatePartStatus(System.Int32)
Access reload information for out of date part.
index:
The index of the information about the part being reloaded. Must be between 0 and OutOfDatePartCount.
Returns:
Information about the part being reloaded.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is out of range.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2019

Autodesk.Revit.DB.ConfigurationReloadInfo.GetConnectivityValidation
Returns information about the post-reload connectivity validation.
Returns:
Information about the post-reload connectivity validation.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo.GetCustomDataChangedElements
Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
Returns:
A list identifying changed elements.
Since:
2019

Autodesk.Revit.DB.ConfigurationReloadInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ConfigurationReloadInfo.OutOfDatePartCount
The number of fabrication part instances that had newer versions and were out of date.
Since:
2019

Autodesk.Revit.DB.ConfigurationReloadInfo.ProfileNotAvailable
The current profile is not available in the disk configuration.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo.Disconnects
The number of disconnections caused by the reload.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo.#ctor
Constructor.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo
This object contains information returned by a reload of the fabrication configuration.
Since:
2016